# 01 - Inspecting Data

In [21]:
import pandas as pd
import numpy as np
df = pd.read_csv('../datasets/intel.csv')

In [3]:
df.head(3)

         Date       Open       High        Low      Close
0  10/10/2017  39.930000  39.950001  39.380001  39.650002
1  11/10/2017  39.480000  39.669998  39.060001  39.299999
2  12/10/2017  39.349998  39.389999  38.980000  39.189999

In [4]:
df.describe()

             Open        High         Low       Close
count  253.000000  253.000000  253.000000  253.000000
mean    48.423360   48.964427   47.859881   48.429565
std      4.039893    4.085279    3.966219    4.013455
min     39.349998   39.389999   38.980000   39.189999
25%     45.619999   46.070000   45.119999   45.540001
50%     48.099998   48.759998   47.480000   48.099998
75%     51.689999   52.169998   51.000000   51.720001
max     57.009998   57.599998   56.779999   57.080002

In [6]:
df.shape

(253, 5)

In [7]:
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close'], dtype='object')

In [10]:
#recort
df2 = df[['Open' ,'Close']]
df2.head(3)

        Open      Close
0  39.930000  39.650002
1  39.480000  39.299999
2  39.349998  39.189999

# 02 - Filter Data

In [20]:
# eh possivel fazer filtragens aninhadas com uso de &(and) e | (or)
#df[(df.Open > 50) & (df.High >50)].head()
df[df.Open > 50].head()

           Date       Open       High        Low      Close
96   28/02/2018  50.180000  50.340000  49.279999  49.290001
100  06/03/2018  50.160000  51.330002  50.150002  50.709999
101  07/03/2018  50.180000  51.490002  50.099998  51.320000
102  08/03/2018  51.790001  52.080002  50.470001  50.740002
103  09/03/2018  51.270000  52.299999  51.000000  52.189999

In [22]:
counties = ['Antrim','Armagh','Carlow','Cavan','Clare','Cork','Derry','Donegal','Down','Dublin','Fermanagh','Galway',
            'Kerry','Kildare','Kilkenny','Laois','Leitrim','Limerick','Longford','Louth','Mayo','Meath','Monaghan',
            'Offaly','Roscommon','Sligo','Tipperary','Tyrone','Waterford','Westmeath','Wexford','Wicklow']

# Create a string with the value 'IRELAND'
country = "IRELAND"

# Create new dictionary
ireland = {'Country':country, 'County':counties}

# Create a DataFrame from the dictionary
df3 = pd.DataFrame(ireland)

df3

    Country     County
0   IRELAND     Antrim
1   IRELAND     Armagh
2   IRELAND     Carlow
3   IRELAND      Cavan
4   IRELAND      Clare
5   IRELAND       Cork
6   IRELAND      Derry
7   IRELAND    Donegal
8   IRELAND       Down
9   IRELAND     Dublin
10  IRELAND  Fermanagh
11  IRELAND     Galway
12  IRELAND      Kerry
13  IRELAND    Kildare
14  IRELAND   Kilkenny
15  IRELAND      Laois
16  IRELAND    Leitrim
17  IRELAND   Limerick
18  IRELAND   Longford
19  IRELAND      Louth
20  IRELAND       Mayo
21  IRELAND      Meath
22  IRELAND   Monaghan
23  IRELAND     Offaly
24  IRELAND  Roscommon
25  IRELAND      Sligo
26  IRELAND  Tipperary
27  IRELAND     Tyrone
28  IRELAND  Waterford
29  IRELAND  Westmeath
30  IRELAND    Wexford
31  IRELAND    Wicklow